In [106]:
import pandas as pd
s=pd.Series([1,2,3,4,5])
print(s)
s.dtype
s.values

0    1
1    2
2    3
3    4
4    5
dtype: int64

array([1, 2, 3, 4, 5])

In [107]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [108]:
s.name="numbers"
print(s.name)
s

numbers

0    1
1    2
2    3
3    4
4    5
Name: numbers, dtype: int64

In [109]:
s.name="calories"
print(s)

0    1
1    2
2    3
3    4
4    5
Name: calories, dtype: int64

In [110]:
print(s.name)

calories

In [111]:
index=["apple","banana","grapes","strawberry","banana"]

In [112]:
import pandas as pd
print(pd.__version__)

3.0.0

In [113]:
print(s.iloc[3])

4

In [114]:
s.index=index
print(s)

apple         1
banana        2
grapes        3
strawberry    4
banana        5
Name: calories, dtype: int64

In [115]:
print(s["grapes"])

3

In [116]:
print(s.loc["grapes"])

3

In [117]:
print(s["apple":"strawberry"])

apple         1
banana        2
grapes        3
strawberry    4
Name: calories, dtype: int64

In [118]:
fruits_calories={
    "avacado":2.0,
    "pear":5.0,
    "peach":6.0,
    "guava":4.0,
    "cherry":8.0
}
fruit=pd.Series(fruits_calories,name="proteins")
fruit

avacado    2.0
pear       5.0
peach      6.0
guava      4.0
cherry     8.0
Name: proteins, dtype: float64

In [119]:
fruit>3

avacado    False
pear        True
peach       True
guava       True
cherry      True
Name: proteins, dtype: bool

In [120]:
fruit[fruit>3]

pear      5.0
peach     6.0
guava     4.0
cherry    8.0
Name: proteins, dtype: float64

In [121]:
#logical operators
[(fruit>3) & (fruit<5)]

[avacado    False
 pear       False
 peach      False
 guava       True
 cherry     False
 Name: proteins, dtype: bool]

In [122]:
fruit[(fruit>3)&(fruit<=5)]

pear     5.0
guava    4.0
Name: proteins, dtype: float64

In [123]:
fruit[~(fruit>3)]

avacado    2.0
Name: proteins, dtype: float64

In [124]:
s["avacado"]=5.5
s

apple         1.0
banana        2.0
grapes        3.0
strawberry    4.0
banana        5.0
avacado       5.5
Name: calories, dtype: float64

In [125]:
import numpy as np
ser=pd.Series([np.nan,1,np.nan,2])
ser.notnull().sum()

np.int64(2)

In [126]:
#data frame
data={
    "Name":["Alice","Bob","Charlie","David","Eve","Alice"],
    "Age":[25,30,35,np.nan,29,25],
    "Department":["HR","IT","Finance","IT","HR","HR"],
    "Salary":[50000,60000,70000,62000,np.nan,50000]
}
data

{'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Alice'],
 'Age': [25, 30, 35, nan, 29, 25],
 'Department': ['HR', 'IT', 'Finance', 'IT', 'HR', 'HR'],
 'Salary': [50000, 60000, 70000, 62000, nan, 50000]}

In [127]:
df=pd.DataFrame(data)
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [128]:
df.head(3)

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0

In [129]:
df.tail(3)

    Name   Age Department   Salary
3  David   NaN         IT  62000.0
4    Eve  29.0         HR      NaN
5  Alice  25.0         HR  50000.0

In [130]:
df.iloc[1:3]

      Name   Age Department   Salary
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0

In [131]:
df.loc[1:3]

      Name   Age Department   Salary
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0

In [132]:
df.shape

(6, 4)

In [133]:

#df.drop("Age",axis=1,inplace=True)
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [134]:
df.info

<bound method DataFrame.info of       Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0>

In [135]:
type(df)
print(df.describe())

             Age        Salary
count   5.000000      5.000000
mean   28.800000  58400.000000
std     4.147288   8532.291603
min    25.000000  50000.000000
25%    25.000000  50000.000000
50%    29.000000  60000.000000
75%    30.000000  62000.000000
max    35.000000  70000.000000

In [137]:
df.loc[1:2,["Age","Department"]]

    Age Department
1  30.0         IT
2  35.0    Finance

In [139]:
df["Age"]

0    25.0
1    30.0
2    35.0
3     NaN
4    29.0
5    25.0
Name: Age, dtype: float64

In [140]:
df.shape

(6, 4)

In [141]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      str
 1   Age         5 non-null      float64
 2   Department  6 non-null      str
 3   Salary      5 non-null      float64
dtypes: float64(2), str(2)
memory usage: 324.0 bytes

In [143]:
df.rename(columns={"Department":"Dept"},inplace=True)
df

      Name   Age     Dept   Salary
0    Alice  25.0       HR  50000.0
1      Bob  30.0       IT  60000.0
2  Charlie  35.0  Finance  70000.0
3    David   NaN       IT  62000.0
4      Eve  29.0       HR      NaN
5    Alice  25.0       HR  50000.0

In [145]:
df["Dept"].unique()

<StringArray>
['HR', 'IT', 'Finance']
Length: 3, dtype: str

In [146]:
#value count
df["Dept"].value_counts()

Dept
HR         3
IT         2
Finance    1
Name: count, dtype: int64

In [149]:
df["promoted Salary"]=df["Salary"]*10
df

      Name   Age     Dept   Salary  promoted Salary
0    Alice  25.0       HR  50000.0         500000.0
1      Bob  30.0       IT  60000.0         600000.0
2  Charlie  35.0  Finance  70000.0         700000.0
3    David   NaN       IT  62000.0         620000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  50000.0         500000.0

In [ ]:
#count null values in a column
df.isnull().sum()

Name               0
Age                1
Dept               0
Salary             1
promoted Salary    1
dtype: int64

In [151]:
df.dropna(how="any")

      Name   Age     Dept   Salary  promoted Salary
0    Alice  25.0       HR  50000.0         500000.0
1      Bob  30.0       IT  60000.0         600000.0
2  Charlie  35.0  Finance  70000.0         700000.0
5    Alice  25.0       HR  50000.0         500000.0

In [152]:
df.dropna(how="all")

      Name   Age     Dept   Salary  promoted Salary
0    Alice  25.0       HR  50000.0         500000.0
1      Bob  30.0       IT  60000.0         600000.0
2  Charlie  35.0  Finance  70000.0         700000.0
3    David   NaN       IT  62000.0         620000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  50000.0         500000.0

In [153]:
df.fillna(0)

      Name   Age     Dept   Salary  promoted Salary
0    Alice  25.0       HR  50000.0         500000.0
1      Bob  30.0       IT  60000.0         600000.0
2  Charlie  35.0  Finance  70000.0         700000.0
3    David   0.0       IT  62000.0         620000.0
4      Eve  29.0       HR      0.0              0.0
5    Alice  25.0       HR  50000.0         500000.0

In [154]:
df["Age"].fillna(df["Age"].mean)

0                                                 25.0
1                                                 30.0
2                                                 35.0
3    <bound method Series.mean of 0    25.0\n1    3...
4                                                 29.0
5                                                 25.0
Name: Age, dtype: object

In [155]:
df["Salary"].ffill()

0    50000.0
1    60000.0
2    70000.0
3    62000.0
4    62000.0
5    50000.0
Name: Salary, dtype: float64

In [156]:
df["Age"].bfill()

0    25.0
1    30.0
2    35.0
3    29.0
4    29.0
5    25.0
Name: Age, dtype: float64

In [157]:
df["Name"].replace("Charlie","Rose")

0    Alice
1      Bob
2     Rose
3    David
4      Eve
5    Alice
Name: Name, dtype: str

In [158]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [161]:
dup=df[df.duplicated()]
dup

    Name   Age Dept   Salary  promoted Salary
5  Alice  25.0   HR  50000.0         500000.0

In [172]:
df_dup=df[df.duplicated(keep="first")]
df_dup

Empty DataFrame
Columns: [Name, Age, Dept, Salary, promoted Salary]
Index: []

In [178]:
df["promoted Salary"]=df["promoted Salary"].apply(lambda x:x/10 if x>600000 else x)
df

      Name   Age     Dept   Salary  promoted Salary
0    Alice  25.0       HR  50000.0          50000.0
1      Bob  30.0       IT  60000.0          60000.0
2  Charlie  35.0  Finance  70000.0           7000.0
3    David   NaN       IT  62000.0           6200.0
4      Eve  29.0       HR      NaN              NaN

In [181]:
df["Age"]=df["Age"].apply(lambda x:x*2 if x>25 else x)
df

      Name    Age     Dept   Salary  promoted Salary
0    Alice   25.0       HR  50000.0          50000.0
1      Bob  240.0       IT  60000.0          60000.0
2  Charlie  280.0  Finance  70000.0           7000.0
3    David    NaN       IT  62000.0           6200.0
4      Eve  232.0       HR      NaN              NaN

In [3]:
import pandas as pd
print(pd.Timestamp.today())

2026-01-27 10:45:02.896673

In [4]:
print(pd.Timedelta(days=7))

7 days 00:00:00

In [6]:
import pandas as pd

data = {
    'student_id': [1, 2, 3, 4, 5, 6, 7, 8, 9],
    'course_id':  ['C1', 'C2', 'C1', 'C3', 'C2', 'C3', 'C1', 'C2', 'C3'],
    'login_date': [
        '2026-01-25', '2026-01-20',
        '2026-01-10', '2026-01-05',
        '2026-01-26', '2026-01-18',
        '2026-01-02',
        '2026-01-24', '2026-01-23'
    ],
    'minutes_spent': [30, 45, 20, 50, 60, 40, 15, 35, 55]
}

df = pd.DataFrame(data)
print(df)
df['login_date']=pd.to_datetime(df['login_date'])
cutoff=pd.Timestamp('2026-01-27')-pd.Timedelta(days=7)
last_login=df.groupby('student_id')['login_date'].max().reset_index()
inactive=last_login[last_login['login_date']<cutoff]
print(inactive)

   student_id course_id  login_date  minutes_spent
0           1        C1  2026-01-25             30
1           2        C2  2026-01-20             45
2           3        C1  2026-01-10             20
3           4        C3  2026-01-05             50
4           5        C2  2026-01-26             60
5           6        C3  2026-01-18             40
6           7        C1  2026-01-02             15
7           8        C2  2026-01-24             35
8           9        C3  2026-01-23             55
   student_id login_date
2           3 2026-01-10
3           4 2026-01-05
5           6 2026-01-18
6           7 2026-01-02